# Restructuring data with Pandas

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continuing to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.


#### Our goals today are to be able to:

Use the pandas library to:

- Get summary info about a dataset and its variables using `.describe()`, `.mean()`, `.max()`, `.min()`
- Reshape a DataFrame using joins, merges, pivoting, concatenating, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). We answered a few questions about this data yesterday.  What other questions could we ask and answer using this dataset?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al

total 49512
drwxr-xr-x  15 mmitchell3  staff       480 Sep 18 09:34 .
drwxr-xr-x   7 mmitchell3  staff       224 Sep 16 09:56 ..
-rw-r--r--@  1 mmitchell3  staff      6148 Sep 18 09:01 .DS_Store
drwxr-xr-x  14 mmitchell3  staff       448 Sep 17 20:11 .git
-rw-r--r--   1 mmitchell3  staff      1799 Sep 16 09:56 .gitignore
drwxr-xr-x   4 mmitchell3  staff       128 Sep 17 20:13 .ipynb_checkpoints
-rw-r--r--   1 mmitchell3  staff        30 Sep 16 09:56 README.md
-rw-r--r--   1 mmitchell3  staff        95 Jul  5  2019 ds_chars.csv
-rw-r--r--   1 mmitchell3  staff     11328 Jul  5  2019 heart.csv
drwxr-xr-x   4 mmitchell3  staff       128 Jul  5  2019 images
-rw-r--r--   1 mmitchell3  staff  12962419 Sep 17 19:37 intakes.pkl
-rw-r--r--   1 mmitchell3  staff  12245991 Sep 17 19:37 outcomes.pkl
-rw-r--r--   1 mmitchell3  staff      3297 Jul  5  2019 pre_process_animal_shelter_data.py
-rw-r--r--   1 mmitchell3  staff     95474 Sep 18 09:34 restructuring_data_with_pandas-SOLUTION.ipynb
-rw-r--r--   1 mmitchell3  staff       130 Jul  5  2019 states.csv

In [2]:
import pandas as pd
uci = pd.read_csv('heart.csv')

In [3]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [4]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [5]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [6]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [7]:
uci.ca.mean()

0.7293729372937293

In [8]:
uci.mean()

age          54.366337
sex           0.683168
cp            0.966997
trestbps    131.623762
chol        246.264026
fbs           0.148515
restecg       0.528053
thalach     149.646865
exang         0.326733
oldpeak       1.039604
slope         1.399340
ca            0.729373
thal          2.313531
target        0.544554
dtype: float64

### Apply to Animal Shelter Data
Using `.info()`, `.describe()`, `.value_counts()`, and `dtypes` what observations can we make about the data?

What breed of dog is the most prevalent in the intakes dataset?

What is the age of the oldest animal in the outcomes dataset?

In [9]:
outcomes = pd.read_pickle('./outcomes.pkl')
intakes = pd.read_pickle('./intakes.pkl')

In [10]:
# your code here

In [11]:
#SOLUTION
intakes.breed.value_counts()

Domestic Shorthair Mix                     30028
Pit Bull Mix                                8024
Labrador Retriever Mix                      6293
Chihuahua Shorthair Mix                     6008
Domestic Shorthair                          3531
                                           ...
Miniature Poodle/American Eskimo               1
Bull Terrier/Black Mouth Cur                   1
Chinese Sharpei/Basset Hound                   1
Jack Russell Terrier/Manchester Terrier        1
Irish Wolfhound/Cardigan Welsh Corgi           1
Name: breed, Length: 2468, dtype: int64

In [12]:
outcomes.years_old.max()

25.03287671232877

## Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [13]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

These fuctions can help you identify which indices belong to which group and to select just the rows of a given group.

In [14]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [15]:
uci.groupby('sex').get_group(0) # .tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
11,48,0,2,130,275,0,1,139,0,0.2,2,0,2,1
14,58,0,3,150,283,1,0,162,0,1.0,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Aggregating

Once we have our groups we can then calculate statistics on each group.  Below we are looking for the standard deviation of each variable split apart by sex.

In [16]:
uci.groupby('sex').std()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,9.409396,0.972427,19.311119,65.088946,0.332455,0.557150,20.047969,0.422503,1.119844,0.593736,0.881026,0.441290,0.435286
1,8.883803,1.059064,16.658246,42.782392,0.366955,0.510754,24.130882,0.484505,1.174632,0.627378,1.074082,0.659949,0.498626

Exercise: Tell me the average cholesterol level for those with heart disease.

In [17]:
# Your code here!

In [18]:
#SOLUTION
uci.groupby('target').chol.mean()

target
0    251.086957
1    242.230303
Name: chol, dtype: float64

### Your turn: Use groupby methods to examine the animal shelter data

In your group complete tasks 1 and 2

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types in the outcomes dataset.
- What about by animal types **and** gender?

In [19]:
# your code here

In [20]:
#SOLUTION
outcomes.groupby('animal_type').years_old.mean()

animal_type
Bird         1.404894
Cat          1.458022
Dog          2.797450
Livestock    1.200967
Other        1.272168
Name: years_old, dtype: float64

In [21]:
#SOLUTION
outcomes.groupby(['animal_type', 'sex_upon_outcome']).years_old.mean()

animal_type  sex_upon_outcome
Bird         Intact Female       2.200476
             Intact Male         1.539689
             Unknown             1.133722
Cat          Intact Female       0.909455
             Intact Male         0.618375
             Neutered Male       1.956139
             Spayed Female       1.999191
             Unknown             0.510562
Dog          Intact Female       2.289025
             Intact Male         2.472064
             Neutered Male       2.971820
             Spayed Female       2.868525
             Unknown             1.048743
Livestock    Intact Female       1.308806
             Intact Male         1.729863
             Neutered Male       1.030137
             Unknown             0.393836
Other        Intact Female       1.598120
             Intact Male         1.454917
             Neutered Male       1.565630
             Spayed Female       1.556425
             Unknown             1.224676
Name: years_old, dtype: float64

#### Task 2:
- Create new columns `year` and `month` by using a lambda function `x.year` on date of outcome
- Use `groupby` and `.size()` to tell me how many animals are adopted by month using the outcome dataset

In [22]:
# Your code here

In [23]:
#SOLUTION
outcomes['year'] = outcomes.date_o.apply(lambda x: x.year)
outcomes['month'] = outcomes.date_o.apply(lambda x: x.month)
outcomes.groupby('month').size()

month
1      7637
2      6882
3      8230
4      8208
5      9998
6     10888
7     11049
8     10451
9      9447
10     9242
11     8133
12     8351
dtype: int64

## Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [24]:
uci.pivot(values = 'age', columns = 'target')

target     0     1
0        NaN  63.0
1        NaN  37.0
2        NaN  41.0
3        NaN  56.0
4        NaN  57.0
..       ...   ...
298     57.0   NaN
299     45.0   NaN
300     68.0   NaN
301     57.0   NaN
302     57.0   NaN

[303 rows x 2 columns]

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

See documentation from [pandas](https://pandas.pydata.org/docs/user_guide/merging.html)

### `.join()`

In [25]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [26]:
toy1.join(toy2.set_index('age'),
          on = 'age',
          lsuffix = '_A',
          rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

### `.merge()`

The pandas `.merge()` function is very similar to `.join()` but offers some further versatility (at the cost of requiring more detailed inputs).  This method may be preferred when you don't want to join the dataframes on the index.

In [27]:
ds_chars = pd.read_csv('ds_chars.csv', index_col = 0)

In [28]:
states = pd.read_csv('states.csv', index_col = 0)

In [29]:
ds_chars.merge(states,
               left_on='home_state',
               right_on = 'state',
               how = 'inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [30]:
pd.concat([ds_chars, states])

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [31]:
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [32]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

     name    variable value
0    greg          HP   200
1   miles          HP   200
2    alan          HP   170
3  alison          HP   300
4  rachel          HP   200
5    greg  home_state    WA
6   miles  home_state    WA
7    alan  home_state    TX
8  alison  home_state    DC
9  rachel  home_state    TX

## Your turn!

Merge the intakes and outcomes datasets to answer the question __How long is average stay for animals in this shelter?__

- What data do we need to solve this question?
- What columns from which dataset?

In [33]:
#your code here

In [34]:
#SOLUTION
# get more date info
intakes['year'] = intakes['date_intake'].apply(lambda x: x.year)

In [35]:
#SOLUTION
animal_shelter_df  = pd.merge(intakes, 
                              outcomes, 
                              on=['animal_id', 'year'], 
                              how='left', 
                              suffixes=('_intake', '_outcome'))

animal_shelter_df = animal_shelter_df[(~animal_shelter_df['date_o'].isna()) 
                                      & (animal_shelter_df['date_o'] > animal_shelter_df['date_intake'])]

In [36]:
#SOLUTION
animal_shelter_df['days_in_shelter'] = (animal_shelter_df['date_o'] - animal_shelter_df['date_intake']).dt.days

In [37]:
#SOLUTION
pd.set_option('display.max_columns', 500)
animal_shelter_df.head()

,animal_id,name_intake,datetime,monthyear_intake,found_location,intake_type,intake_condition,animal_type_intake,sex_upon_intake,age_upon_intake,breed_intake,color_intake,date_intake,year,name_outcome,monthyear_outcome,outcome_type,outcome_subtype,animal_type_outcome,sex_upon_outcome,age_upon_outcome,breed_outcome,color_outcome,date_o,dob,age,years_old,month,days_in_shelter
107,A805309,NaN,09/25/2019 11:59:00 AM,09/25/2019 11:59:00 AM,10110 Blake Manor in Travis (TX),Stray,Injured,Dog,Intact Male,4 years,Great Pyrenees,White,2019-09-25,2019,No name given,09/26/2019 01:25:00 PM,Transfer,Partner,Dog,Intact Male,4 years,Great Pyrenees,White,2019-09-26,2015-09-25,1462 days,4.005479,9.0,1
118,A805286,NaN,09/25/2019 10:22:00 AM,09/25/2019 10:22:00 AM,Cedar Bend And Metric Blvd in Austin (TX),Stray,Injured,Dog,Intact Female,7 years,Cairn Terrier,Tan,2019-09-25,2019,No name given,09/26/2019 12:27:00 PM,Transfer,Partner,Dog,Intact Female,7 years,Cairn Terrier,Tan,2019-09-26,2012-09-25,2557 days,7.005479,9.0,1
140,A805269,Prada,09/24/2019 05:11:00 PM,09/24/2019 05:11:00 PM,Berkman Drive And Coronado Hills Drive in Aust...,Stray,Normal,Dog,Spayed Female,6 years,Yorkshire Terrier,Black/Gray,2019-09-24,2019,Prada,09/25/2019 04:19:00 PM,Return to Owner,Unknown,Dog,Spayed Female,6 years,Yorkshire Terrier,Black/Gray,2019-09-25,2013-09-24,2192 days,6.005479,9.0,1
154,A805252,Ezio,09/24/2019 03:00:00 PM,09/24/2019 03:00:00 PM,Marble Creek Loop in Austin (TX),Stray,Normal,Dog,Intact Male,6 years,Pomeranian/Beagle,Cream,2019-09-24,2019,Ezio,09/25/2019 01:19:00 PM,Return to Owner,Unknown,Dog,Intact Male,6 years,Pomeranian/Beagle,Cream,2019-09-25,2013-03-24,2376 days,6.509589,9.0,1
155,A805251,Cash,09/24/2019 02:50:00 PM,09/24/2019 02:50:00 PM,1500 Red River in Austin (TX),Public Assist,Normal,Dog,Intact Male,1 year,Australian Shepherd,Blue Merle/White,2019-09-24,2019,Cash,09/26/2019 06:50:00 PM,Return to Owner,Unknown,Dog,Intact Male,1 year,Australian Shepherd,Blue Merle/White,2019-09-26,2018-09-24,367 days,1.005479,9.0,2

In [38]:
#SOLUTION
animal_shelter_df.days_in_shelter.mean()

20.991161231331912

#### What if we wanted to know if the mean days in the shelter differs based on animal type?

In [39]:
#Your code here

In [40]:
#SOLUTION
animal_shelter_df.groupby('animal_type_intake').days_in_shelter.mean()

animal_type_intake
Bird         11.128852
Cat          22.617098
Dog          20.794402
Livestock    21.090909
Other         7.055478
Name: days_in_shelter, dtype: float64

## BONUS question! Medical needs

1. How many animals come in injured? And what happens to them?
2. How many animals come in and over their stay get neutered?

In [41]:
#SOLUTION

# How many animals come in injured?
print(len(animal_shelter_df.loc[animal_shelter_df.intake_condition == 'Injured']))

#What happens to them
injured = animal_shelter_df.loc[animal_shelter_df.intake_condition == 'Injured']
injured.outcome_type.value_counts()

3552

Adoption           1273
Transfer           1062
Euthanasia          538
Return to Owner     491
Died                119
Rto-Adopt            30
Disposal             28
Relocate              7
Missing               3
Name: outcome_type, dtype: int64

In [42]:
#SOLUTION

#How many animals get spayed/neutered over their stay?

len(animal_shelter_df.loc[((animal_shelter_df.sex_upon_intake == "Intact Male") 
                       | (animal_shelter_df.sex_upon_intake =='Intact Female'))
                    & ((animal_shelter_df.sex_upon_outcome =='Spayed Female')
                     | (animal_shelter_df.sex_upon_outcome =='Neutered Male'))])

41608